request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="http://webservice.fiusb.ci.infosys.com">
    <soapenv:Header/>
    <soapenv:Body>
        <web:executeService>
            <web:arg_0_0>
                <![CDATA[
                    <FIXML xsi:schemaLocation="http://www.finacle.com/fixml executeFinacleScript.xsd"
                           xmlns="http://www.finacle.com/fixml"
                           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                       <Header>
                          <RequestHeader>
                             <MessageKey>
                                <RequestUUID>Req_1730803476800</RequestUUID>
                                <ServiceRequestId>executeFinacleScript</ServiceRequestId>
                                <ServiceRequestVersion>10.2</ServiceRequestVersion>
                                <ChannelId>COR</ChannelId>
                                <LanguageId></LanguageId>
                             </MessageKey>
                             <RequestMessageInfo>
                                <BankId></BankId>
                                <TimeZone></TimeZone>
                                <EntityId></EntityId>
                                <EntityType></EntityType>
                                <ArmCorrelationId></ArmCorrelationId>
                                <MessageDateTime>2024-10-05T11:44:36.800</MessageDateTime>
                             </RequestMessageInfo>
                             <Security>
                                <Token>
                                   <PasswordToken>
                                      <UserId></UserId>
                                      <Password></Password>
                                   </PasswordToken>
                                </Token>
                                <FICertToken></FICertToken>
                                <RealUserLoginSessionId></RealUserLoginSessionId>
                                <RealUser></RealUser>
                                <RealUserPwd></RealUserPwd>
                                <SSOTransferToken></SSOTransferToken>
                             </Security>
                          </RequestHeader>
                       </Header>
                       <Body>
                          <executeFinacleScriptRequest>
                             <ExecuteFinacleScriptInputVO>
                                <requestId>LAA_payoff.scr</requestId>
                             </ExecuteFinacleScriptInputVO>
                             <executeFinacleScript_CustomData>
                                <tranSubType>BI</tranSubType>
                                <LoanAcct>9920230620000093</LoanAcct>
                                <fundAcct>1990017707</fundAcct>
                                <tranType>T</tranType>
                             </executeFinacleScript_CustomData>
                          </executeFinacleScriptRequest>
                       </Body>
                    </FIXML>
                ]]>
            </web:arg_0_0>
        </web:executeService>
    </soapenv:Body>
</soapenv:Envelope>